readme.tex
% Created 2017-08-21 Mon 15:26
% Intended LaTeX compiler: pdflatex
\documentclass[9pt, b5paper]{article}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{xcolor}
\usepackage{xeCJK}
\setCJKmainfont[Boldfont = STSong SC Black, ItalicFont = STKaiti]{STSong}
\setCJKsansfont{STHeiti}
\setCJKmonofont{STFangsong}
\usepackage{multirow}
\usepackage{multicol}
\usepackage{float}
\usepackage{textcomp}
\usepackage{geometry}
\geometry{left=0.1cm,right=0.1cm,top=0.1cm,bottom=0.1cm}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{latexsym}
\usepackage{natbib}
\usepackage{listings}
\usepackage{minted}
\usepackage[xetex,colorlinks=true,CJKbookmarks=true,linkcolor=blue,urlcolor=blue,menucolor=blue]{hyperref}
\author{deepwaterooo}
\date{\today}
\title{Emacs Configuration}
\hypersetup{
 pdfauthor={deepwaterooo},
 pdftitle={Emacs Configuration},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Updates}
\label{sec:org5f8fe13}
\section{starting point}
\label{sec:org8791210}
\begin{itemize}
\item It is a new computer, and I did try to git clone from my own repository to new laptop, but after fixed errors and tried, \textbf{I promise I do NOT and can NOT bare the out-dated emacs 22.X any more, I have to move on.} I have to install newer versions for my own later on convenience.
\item Instead of configuring my own again, this time, I tried from some "big" person's repository and try to make it work on my laptop (fixing errors, installing necessary packages etc), as well as comment out some complicated modes and customize so that I would still be able to use and like my current emacs interface.
\item It is the first time I tried from some big person's (or any person's configurature completely), it was tidious to fix all the errors at beginning (I spent more than 2 days on it last week. For me it just took too much time), but so far I like some of the feather's that annoying me, but I have not found good solutions to solve it, like how to auto-complete when in scripte comment line or in quotes. I like these detailed feathers which I tried by writing my own snippets from yasnippet mode before.
\item So far, org-mode is not perfect, but still like the previous verison in master branch, it is a fully functional one that I could use.
\item Will devote more time to understand email better, and to solove my own problems and make it more convenient for me to use when I want some feather.
\end{itemize}

\section{{\bfseries\sffamily TODO} s}
\label{sec:orgf216e25}
\begin{itemize}
\item org-mode src code highlight need to be fixed as soon as possible.
\item some minor warnings, modes fixes needs to be done for user convenience.
\item emacs key-bound for mac keyboard, so that it would be convenient for me to type some specific keys.
\item babel org-mode so I don't have to copy from specific babeled source org-mode files in order for chinese characters to work.
\item other major-modes need to be configured, for example: \textbf{java-mode}, \textbf{csharp-mode}, which I would need to use pretty soon.
\item configure and organize emacs better so that it won't take too much time responding.j
\end{itemize}

\section{References}
\label{sec:orgeeb6f7a}
\begin{itemize}
\item \url{https://github.com/redguardtoo/emacs.d}
\end{itemize}
\end{document}